app/controllers/post_controller.rb

  def create
    Post.create(post_params)
---
INSERT INTO "posts" ("title", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "TEST TITLE"], ["link", "www.testtesttest.com\r\n"], ["created_at", "2015-04-29 06:35:29.035455"], ["updated_at", "2015-04-29 06:35:29.035455"]]