app/controllers/user_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    User.create(user_params)